&НаКлиенте
&ИзменениеИКонтроль("РассчитатьСуммуСтроки")
Процедура HW11_РассчитатьСуммуСтроки(ТекущиеДанные)
	
	#Удаление
	ТекущиеДанные.Сумма = ТекущиеДанные.Цена * ТекущиеДанные.Количество;
	#КонецУдаления
	
	#Вставка
	ТекущиеДанные.Сумма = (ТекущиеДанные.Цена * ТекущиеДанные.Количество) - 
	((ТекущиеДанные.Цена * ТекущиеДанные.Количество) * (Объект.HW11_СогласованнаяСкидка / 100));
	#КонецВставки
	
	РассчитатьСуммуДокумента();

КонецПроцедуры

&НаКлиенте
Процедура HW11_ПересчитатьТаблицу(Команда)
	Если Объект.Товары.Количество() <> 0 Тогда
		Для Каждого СтрокаТаблицы из Объект.Товары Цикл
			HW11_РассчитатьСуммуСтроки(СтрокаТаблицы);
		КонецЦикла;
	КонецЕсли;
	Если Объект.Услуги.Количество() <> 0 Тогда
		Для Каждого СтрокаТаблицы из Объект.Услуги Цикл
			HW11_РассчитатьСуммуСтроки(СтрокаТаблицы);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Асинх Процедура HW11_СогласованнаяСкидкаПриИзменении(Элемент)
	Если Объект.Услуги.Количество() <> 0 ИЛИ Объект.Товары.Количество() <> 0 Тогда
		Ответ = Ждать ВопросАсинх("Изменен процент скидки. Пересчитать таблицу товары и услуги?", РежимДиалогаВопрос.ДаНетОтмена);
		Если Ответ = КодВозвратаДиалога.Да Тогда
			HW11_ПересчитатьТаблицу(Элемент);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

